Revit 2027 API
MEPNetworkSegmentData Constructor
Overload List
Name | Description
MEPNetworkSegmentData() |  Creates a default segment data object.
MEPNetworkSegmentData(MEPNetworkSegmentData) |  Creates a new segment data object based on another object.
Top
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace